package fxclient;

public class Questions {
    //!
    //Как и в каком виде передавать файлы?
    // - В виде простого потока байтов, использовать потоки ввода/вывода
    // - сериализацией

    //Как пересылать большие файлы?
    // - разбивать на куски и отправлять кусками


    //Как пересылать служебные команды?
    // --  Например, строка со специальным префиксом: /Send

    //Что хранить в базе данных?
    // -- Данные касаемые пользователей. Например, таблица Users с атрибутами login, password

    //Как передавать структуру каталогов/файлов?
    //Передавать объект класса File и запрашивать структур каталога относительного него, а также структуру самого файла
}
